NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B510F2048GQ100.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EBI</name>
      <description>EBI</description>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EBI</name>
        <value>54</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xCFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D8A8</name>
                  <description>EBI_AD drives 8 bit data, 8 bit address, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16A16ALE</name>
                  <description>EBI_AD drives 16 bit data, 16 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8A24ALE</name>
                  <description>EBI_AD drives 8 bit data, 24 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <description>EBI_AD drives 16 bit data, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE1</name>
              <description>Mode 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D8A8</name>
                  <description>EBI_AD drives 8 bit data, 8 bit address, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16A16ALE</name>
                  <description>EBI_AD drives 16 bit data, 16 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8A24ALE</name>
                  <description>EBI_AD drives 8 bit data, 24 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <description>EBI_AD drives 16 bit data, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE2</name>
              <description>Mode 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D8A8</name>
                  <description>EBI_AD drives 8 bit data, 8 bit address, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16A16ALE</name>
                  <description>EBI_AD drives 16 bit data, 16 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8A24ALE</name>
                  <description>EBI_AD drives 8 bit data, 24 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <description>EBI_AD drives 16 bit data, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE3</name>
              <description>Mode 3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D8A8</name>
                  <description>EBI_AD drives 8 bit data, 8 bit address, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16A16ALE</name>
                  <description>EBI_AD drives 16 bit data, 16 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8A24ALE</name>
                  <description>EBI_AD drives 8 bit data, 24 bit address, ALE is used for address latching. Extended address bits can be enabled.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <description>EBI_AD drives 16 bit data, ALE not used. Extended address bits can be enabled.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK0EN</name>
              <description>Bank 0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BANK1EN</name>
              <description>Bank 1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BANK2EN</name>
              <description>Bank 2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BANK3EN</name>
              <description>Bank 3 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE</name>
              <description>No Idle Cycle Insertion on Bank 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE1</name>
              <description>No Idle Cycle Insertion on Bank 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE2</name>
              <description>No Idle Cycle Insertion on Bank 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE3</name>
              <description>No Idle Cycle Insertion on Bank 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYEN</name>
              <description>ARDY Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYTODIS</name>
              <description>ARDY Timeout Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDY1EN</name>
              <description>ARDY Enable for Bank 1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYTO1DIS</name>
              <description>ARDY Timeout Disable for Bank 1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDY2EN</name>
              <description>ARDY Enable for Bank 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYTO2DIS</name>
              <description>ARDY Timeout Disable for Bank 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDY3EN</name>
              <description>ARDY Enable for Bank 3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYTO3DIS</name>
              <description>ARDY Timeout Disable for Bank 3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BL</name>
              <description>Byte Lane Enable for Bank 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BL1</name>
              <description>Byte Lane Enable for Bank 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BL2</name>
              <description>Byte Lane Enable for Bank 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BL3</name>
              <description>Byte Lane Enable for Bank 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITS</name>
              <description>Individual Timing Set, Line Polarity and Mode Definition Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALTMAP</name>
              <description>Alternative Address Map Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRTIMING</name>
          <description>Address Timing Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000707</resetValue>
          <resetMask>0x10000707</resetMask>
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>Address Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>Address Hold Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFALE</name>
              <description>Half Cycle ALE Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDTIMING</name>
          <description>Read Timing Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00077F07</resetValue>
          <resetMask>0x70077F07</resetMask>
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>Read Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSTRB</name>
              <description>Read Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>Read Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRE</name>
              <description>Half Cycle REn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFETCH</name>
              <description>Prefetch Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGEMODE</name>
              <description>Page Mode Access Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRTIMING</name>
          <description>Write Timing Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00077F07</resetValue>
          <resetMask>0x30077F07</resetMask>
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>Write Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRSTRB</name>
              <description>Write Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>Write Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFWE</name>
              <description>Half Cycle WEn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUFDIS</name>
              <description>Write Buffer Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLARITY</name>
          <description>Polarity Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CSPOL</name>
              <description>Chip Select Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPOL</name>
              <description>Read Enable Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPOL</name>
              <description>Write Enable Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALEPOL</name>
              <description>Address Latch Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDYPOL</name>
              <description>ARDY Polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLPOL</name>
              <description>BL Polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRTIMING1</name>
          <description>Address Timing Register 1</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000707</resetValue>
          <resetMask>0x10000707</resetMask>
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>Address Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>Address Hold Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFALE</name>
              <description>Half Cycle ALE Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDTIMING1</name>
          <description>Read Timing Register 1</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00077F07</resetValue>
          <resetMask>0x70077F07</resetMask>
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>Read Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSTRB</name>
              <description>Read Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>Read Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRE</name>
              <description>Half Cycle REn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFETCH</name>
              <description>Prefetch Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGEMODE</name>
              <description>Page Mode Access Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRTIMING1</name>
          <description>Write Timing Register 1</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00077F07</resetValue>
          <resetMask>0x30077F07</resetMask>
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>Write Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRSTRB</name>
              <description>Write Strobe Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>Write Hold Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFWE</name>
              <description>Half Cycle WEn Strobe Duration Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUFDIS</name>
              <description>Write Buffer Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
